import "./ui/Privacy.css";

export default function Privacy() {
  return (
    <div className="privacy-page">
      <h1 className="privacy-title">Политика конфиденциальности</h1>
      
      <div className="privacy-content">
        <p>
          Настоящая Политика конфиденциальности персональных данных (далее – Политика конфиденциальности) действует в отношении всей информации, которую Интернет-магазин «Komercia», расположенный на доменном имени komercia.shop, может получить о Пользователе во время использования сайта Интернет-магазина, программ и продуктов Интернет-магазина.
        </p>

        <h2>1. Определение терминов</h2>
        <p>1.1. В настоящей Политике конфиденциальности используются следующие термины:</p>
        <ul>
            <li>«Администрация сайта Интернет-магазина (далее – Администрация сайта)» – уполномоченные сотрудники на управление сайтом, действующие от имени «Komercia».</li>
            <li>«Персональные данные» — любая информация, относящаяся к прямо или косвенно определенному или определяемому физическому лицу (субъекту персональных данных).</li>
            <li>«Обработка персональных данных» — любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными.</li>
        </ul>

        <h2>2. Общие положения</h2>
        <p>
            2.1. Использование Пользователем сайта Интернет-магазина означает согласие с настоящей Политикой конфиденциальности и условиями обработки персональных данных Пользователя.
        </p>
        <p>
            2.2. В случае несогласия с условиями Политики конфиденциальности Пользователь должен прекратить использование сайта Интернет-магазина.
        </p>

        <h2>3. Предмет политики конфиденциальности</h2>
        <p>
            3.1. Настоящая Политика конфиденциальности устанавливает обязательства Администрации сайта Интернет-магазина по неразглашению и обеспечению режима защиты конфиденциальности персональных данных, которые Пользователь предоставляет по запросу Администрации сайта при регистрации на сайте интернет-магазина или при оформлении заказа для приобретения Товара.
        </p>

        <h2>4. Цели сбора персональной информации пользователя</h2>
        <p>4.1. Персональные данные Пользователя Администрация сайта Интернет-магазина может использовать в целях:</p>
        <ul>
            <li>Идентификации Пользователя, зарегистрированного на сайте Интернет-магазина, для оформления заказа и (или) заключения Договора купли-продажи товара дистанционным способом с «Komercia».</li>
            <li>Предоставления Пользователю доступа к персонализированным ресурсам Сайта интернет-магазина.</li>
            <li>Установления с Пользователем обратной связи, включая направление уведомлений, запросов, касающихся использования Сайта интернет-магазина.</li>
        </ul>
      </div>
    </div>
  );
}